app/controllers/login_controller.rb

	def create
		begin
			respond_to do |format|
			    if remotipart_submitted?
					begin
				    	first_name = params[:upload][:first_name]
				    	last_name = params[:upload][:last_name]
						puts params[:upload][:resume]
						@resume=Resume.create!( :first_name=>first_name,
							:last_name=>last_name,
							:profile_pic=>params[:upload][:profile_pic],
							:resume => params[:upload][:resume])
---
INSERT INTO "resumes" ("first_name", "last_name", "resume", "profile_pic", "resume_size", "created_at", "updated_at") VALUES ('Mohit', 'D', 'index.png', 'index.png', NULL, '2014-11-04 12:51:39.751695', '2014-11-04 12:51:39.751695')